In [1]:
import pandas

In [2]:
import pandas as pd

In [2]:
df=pd.read_csv('/home/ailab/4VP21AI015_ML/mlsample.csv')
dfimport pandas

NameError: name 'pd' is not defined

In [4]:
import pandas
import pandas as pd
df=pd.read_csv('/home/ailab/4VP21AI015_ML/mlsample.csv')
print(df)

   Sl.No  USN    Name
0      1  123   Rekha
1      2  456  ramesh
2      3  786   Kiran

In [53]:
import pandas
import pandas as pd
df=pd.read_csv('/home/ailab/4VP21AI015_ML/gapminder.csv')
print(df)

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [54]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [55]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [57]:
df.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [58]:
df.shape

(1704, 6)

In [59]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [60]:
df.country

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [61]:
df.country.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [62]:
df.tail()

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [63]:
country_df=df['country']

In [64]:
country_df

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

#

In [65]:
df.loc[1]

country      Afghanistan
continent           Asia
year                1957
lifeExp           30.332
pop              9240934
gdpPercap      820.85303
Name: 1, dtype: object

In [66]:
df.tail(n=1)

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [67]:
df.loc[99]

country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap    721.186086
Name: 99, dtype: object

In [68]:
df.iloc[[0,49,99]]

        country continent  year  lifeExp       pop    gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333   779.445314
49    Argentina  Americas  1957   64.399  19610538  6856.856212
99   Bangladesh      Asia  1967   43.453  62821884   721.186086

In [69]:
df.loc[[0,49,99]]

        country continent  year  lifeExp       pop    gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333   779.445314
49    Argentina  Americas  1957   64.399  19610538  6856.856212
99   Bangladesh      Asia  1967   43.453  62821884   721.186086

In [70]:
subset=df.loc[:'year','pop']

In [71]:
subset

0        8425333
1        9240934
2       10267083
3       11537966
4       13079460
          ...
1699     9216418
1700    10704340
1701    11404948
1702    11926563
1703    12311143
Name: pop, Length: 1704, dtype: int64

In [72]:
subset=df.loc[:,['year','pop']]

In [73]:
subset

      year       pop
0     1952   8425333
1     1957   9240934
2     1962  10267083
3     1967  11537966
4     1972  13079460
...    ...       ...
1699  1987   9216418
1700  1992  10704340
1701  1997  11404948
1702  2002  11926563
1703  2007  12311143

[1704 rows x 2 columns]

In [74]:
import csv

In [75]:
import os

In [76]:
os.getcwd()

'/home/ailab/4VP21AI015_ML'

In [84]:
os.chdir('/home/ailab/4VP21AI015_ML')
A=open('mlsample.csv')
B=csv.reader(A)
C=list(B)
C

[['Sl.No', 'USN', 'Name'],
 ['1', '123', 'Rekha'],
 ['2', '456', 'ramesh'],
 ['3', '786', 'Kiran']]

In [85]:
print(C)

[['Sl.No', 'USN', 'Name'], ['1', '123', 'Rekha'], ['2', '456', 'ramesh'], ['3', '786', 'Kiran']]

NameError: name 'C' is not defined

In [2]:
import pandas
import pandas as pd
df=pd.read_csv('/home/ailab/4VP21AI015_ML/mlsample.csv')
print(df)

   Sl.No  USN    Name
0      1  123   Rekha
1      2  456  ramesh
2      3  786   Kiran

In [3]:
df

   Sl.No  USN    Name
0      1  123   Rekha
1      2  456  ramesh
2      3  786   Kiran

In [4]:
os.chdir('/home/ailab/4VP21AI015_ML')
A=open('mlsample.csv')
B=csv.reader(A)
C=list(B)
C

NameError: name 'os' is not defined

In [5]:
import csv

In [6]:
import os

In [7]:
os.chdir('/home/ailab/4VP21AI015_ML')
A=open('mlsample.csv')
B=csv.reader(A)
C=list(B)
C

[['Sl.No', 'USN', 'Name'],
 ['1', '123', 'Rekha'],
 ['2', '456', 'ramesh'],
 ['3', '786', 'Kiran']]

In [10]:
df=pd.read_csv('/home/ailab/4VP21AI015_ML/gapminder.csv')
print(df)

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [11]:
import pandas
import pandas as pd
df=pd.read_csv('/home/ailab/4VP21AI015_ML/mlsample.csv')
print(df)

   Sl.No  USN    Name
0      1  123   Rekha
1      2  456  ramesh
2      3  786   Kiran

In [12]:
df

   Sl.No  USN    Name
0      1  123   Rekha
1      2  456  ramesh
2      3  786   Kiran

In [13]:
df.head()

   Sl.No  USN    Name
0      1  123   Rekha
1      2  456  ramesh
2      3  786   Kiran

In [14]:
df.tail()

   Sl.No  USN    Name
0      1  123   Rekha
1      2  456  ramesh
2      3  786   Kiran

In [15]:
df.dtypes

Sl.No     int64
USN       int64
Name     object
dtype: object

In [16]:
df.shape

(3, 3)

In [17]:
df.columns

Index(['Sl.No', 'USN', 'Name'], dtype='object')

In [20]:
df.USN

0    123
1    456
2    786
Name: USN, dtype: int64

In [22]:
df.Name.head()

0     Rekha
1    ramesh
2     Kiran
Name: Name, dtype: object

In [23]:
df.tail()

   Sl.No  USN    Name
0      1  123   Rekha
1      2  456  ramesh
2      3  786   Kiran

In [24]:
Name_df=df['Name']

In [26]:
print(Name_df)

0     Rekha
1    ramesh
2     Kiran
Name: Name, dtype: object

In [27]:
df.loc[1]

Sl.No         2
USN         456
Name     ramesh
Name: 1, dtype: object

df.iloc[2]

In [28]:
df.iloc[2]

Sl.No        3
USN        786
Name     Kiran
Name: 2, dtype: object

In [29]:
df.loc[[0,1]]

   Sl.No  USN    Name
0      1  123   Rekha
1      2  456  ramesh

In [30]:
a=df.loc[:'USN','Name']

In [31]:
a

0     Rekha
1    ramesh
2     Kiran
Name: Name, dtype: object

In [32]:
a=df.loc[:,['USN','Name']]

In [33]:
a

   USN    Name
0  123   Rekha
1  456  ramesh
2  786   Kiran

In [34]:
df.tail(n=1)

   Sl.No  USN   Name
2      3  786  Kiran